# CalculateExtrusionData Method (IFCExtrusionCalculatorOptions, IList(Face))

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCalculatorUtils..::..CalculateExtrusionData Method (IFCExtrusionCalculatorOptions, IList<(Of <(<'Face>)>)>)
IFCExtrusionCalculatorUtils Class See Also
---
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static IList<IFCExtrusionData> CalculateExtrusionData(
	IFCExtrusionCalculatorOptions extrInfo,
	IList<Face> allInputFaces
)
```

Visual Basic
---
```text
Public Shared Function CalculateExtrusionData ( _
	extrInfo As IFCExtrusionCalculatorOptions, _
	allInputFaces As IList(Of Face) _
) As IList(Of IFCExtrusionData)
```

Visual C++
---
```text
public:
static IList<IFCExtrusionData^>^ CalculateExtrusionData(
	IFCExtrusionCalculatorOptions^ extrInfo,
	IList<Face^>^ allInputFaces
)
```

# ### Parameters
extrInfo
    Type: Autodesk.Revit.DB.IFC..::..IFCExtrusionCalculatorOptions
allInputFaces
    Type: System.Collections.Generic..::..IList<(Of <(<'Face>)>)>
# See Also
IFCExtrusionCalculatorUtils Class
CalculateExtrusionData Overload
Autodesk.Revit.DB.IFC Namespace